# -*- coding: utf-8 -*-
#声音的三要素——响度、音调、音品
'''
一响度
(一)声音的强弱称为「响度」，通常以「分贝」(dB)来表示响度的大小。

(二)声波振幅愈大则响度愈大。 用力敲打音叉，音叉两股振动幅度愈大，

便可产生较大振幅的声波。 反之小力敲打则声波振幅小。

(三)响度大小可用「噪音计」测得分贝值。 振幅大小之比较可由

「示波器」之萤幕直接观察。

(四)以下为几种环境中的约略响度:

声音	响度
人耳听觉的下限	0
树叶的沙沙声	10
耳语(相距1公尺)	20
清早时的街道	30
办公室	40
平常的交谈声音(相距1公尺处)	50
繁忙的街道	60
上下班时的台北巿火车站	70
气压钻孔机(相距3公尺处)	80
10瓦特立体音响唱机(相距3公尺处)	90
人耳开始感到痛楚	100
喷射机引擎声(相距50公尺处)	110
太空火箭的引擎声(相距50公尺处)	120
动动手试试看:响度与振幅

(1)取一个连接音响或收录音机的喇叭(功率愈高愈好)，开口朝上平放在桌上。

(2)撒一些保丽龙屑在喇叭上(最好能直接撒在喇叭的鼓膜上)

(3)打开音响使喇叭发出声音，注意保丽龙屑有没有跳动。

(4)调整音量大小，并比较保丽龙屑跳动的情形。

想想看为什么

(1)喇叭发出声音时，保丽龙屑是否随之跳动?

(2)保丽龙屑跳动的激烈程度是否随着音量加大而增加?

(3)空气分子可视同无数个极小、极轻且弹性极佳的小球。

当喇叭的鼓膜振动发音时，附近的空气分子是否也像保丽龙屑一般地弹跳，

且随着音量加大而弹跳得愈激烈?

(4)本实验是否能说明响度大小与振幅之关系?

二、音调

(一)声音的高低称为「音调」。

钢琴(或电子琴)上不同的按键可弹出不同音调的声音。

(二)声音的音调由发音体的振动频率决定，频率愈高则音调愈高。

一般乐器所发出的声音频率约为20-400OHz 之间，

人类发出的声音频率约为80-10OOHz 之间。

人类耳朵的听觉范围约在20-200OOHz 之间，

狗的听觉范围约在15-500OOHz 之间。

(三)发音体的质量、厚薄、长短、松紧……等因素都会影响发音的频率。

轻、薄、短、紧则振动快，频率大且音调高。

反之，重、厚、长、松则振动慢、频率小且音调低。

(四) 各种乐器都是利用调节振动部位的质量、厚薄、长短、松紧……等，

来发出不同音调的声音，而演奏出各种旋律的音乐。 例如:

1. 钢琴和吉他借着拨动不同粗细、长短、松紧的弦，来发出不同的音调。

2． 萧和笛子借着改变不同位置孔洞的开、阖，来调整管内空气柱长度，

而发出不同音调的声音。

动动手试试看:音调与频率

(1)启动电扇，将转速调到最低转。

用手抓紧一张明信片或卡纸，慢慢靠近并轻轻接触转动的扇叶。

听听看尺振动的声音音调如何?

(2)同(1)之操作，但使电扇转速加快。 听听看音调如何?

(3)同(2)之操作，但一边听明信片振动的声音一边将电源关掉，

注意音调变化情形。

想想看为什么

(1)步骤(1)、(2)中音调高低是否不同?

音调的高低与扇叶转动的频率有何关系?

(2)在步骤(3)中，电源关掉后转速逐渐变慢，明信片所发出的声音如何改变?

能否说明物体振动愈慢，所发出的声音音调愈低?

(3)能否预测，当电扇转速逐渐加快的过程中，

明信片振动所发出的声音音调如何改变?

动动手试试看:音调与空气柱长度

(1)取一空的保特瓶(约12OOcc )，以下唇紧靠保特瓶的瓶缘吹气，使发出声音?

(2)在保特瓶内装半瓶水，重复(1)之操作，并比较声音音调有何不同?

(3)重复(1)之操作，但保特瓶内分别装水约3/4瓶、7/8瓶、15/16瓶……。

比较声音音调有何不同?

(4)改用不同大小的笔盖来吹出声音，并比较声音音调有何不同?

想想看为什么

(1)由以上操作(1)-(3)中，能否归纳出瓶内水量的多少与

所发出的声音音调高低有何关系?

(2)向瓶内吹气时，瓶内空气柱振动而发出声音。

本实验能否说明空气柱愈短，振动所发出的声音音调愈高?

(3)将水倒入瓶子时，随着水位升高可以听到水声的音调也逐渐升高。

此现象是否与本实验同样的道理?

又萧或笛子可以吹奏出不同的音调，是否也是相同道理?

二、音品

(一)声音的独特性称为「音品」，又称「音色」。

(二)不同的发音体产生不同的波形，而形成不同的音品。

(三)大部分的乐器所发出之声波都不是单纯的正弦波，

而是由基音和多组不同频率的泛音复合而成的复合波。

(泛音的频率必为基音频率的整数倍)。



(四)对于同一乐器所发出的声音，其响度、音调都可以调整，

但是基音和各组泛音的强度比却是一定的，其音品也是一定的。

1． 当响度改变时，只有振幅改变，但是音品不变。



2． 当音调改变时，(基音)频率改变，各组泛音的频率也随之改变，

但是音品不变。



(五)对于不同的乐器所发出的声音，即使响度、音调都调成一样，

但是基音和各组泛音的强度比却都不相同，其音品也不相同。

以下为四种不同的乐器，以相同响度、相同音调所发出的声音波形。



重叠原理

复合波之振幅是由基音的振幅和各组泛音的振幅重叠而成。

若振幅方向相同则可相加; 若振幅方向相反则须相减。

例: 下图为基音与第四泛音所组成的复合波。



动动手试试看:比较波形

根据「重叠原理」画出以下各种情形下( 图乙、丁、己) 的复合波，并比较异同点。

(1)同一乐器，音调相同，响度不同: ( 基音与第三泛音之振幅比为2:1)





(2)同一乐器，响度相同，音调不同（基音与第三泛音之振幅比为2：1）

丙、音调低 

丁、音调高 

(3)不同乐器，响度相同，音调也相同。

基音与第三泛音之振幅比分别为

戌、2:1 

己、1:2 

"想想看为什么的参考答案

[实验] 响度与振幅

1． 是2． 是3，是4． 是

[实验] 音调与频率

1. 是，扇叶转动愈快，名信片所发声音音调愈高;

扇叶转动愈慢，名信片所发声音音调愈低。

2. 音调愈来愈低沉。 是

3． 应该会愈来愈高

[实验] 音调与空气柱长度

1． 水量愈多音调愈高

2． 可说明空气柱愈短时振动所发的声音音调愈高。

3、是。 是

[实验] 比较波形'''
